tutorials/multiCompression/quadPiston/case/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

11
(
    injectionXMinus
    {
        type            wall;
        inGroups        1(wall);
        nFaces          2;
        startFace       8239;
    }
    injectionXPlus
    {
        type            wall;
        inGroups        1(wall);
        nFaces          2;
        startFace       8241;
    }
    injectionYMinus
    {
        type            wall;
        inGroups        1(wall);
        nFaces          2;
        startFace       8243;
    }
    injectionYPlus
    {
        type            wall;
        inGroups        1(wall);
        nFaces          2;
        startFace       8245;
    }
    inletXMinus
    {
        type            wall;
        inGroups        1(wall);
        nFaces          12;
        startFace       8247;
    }
    inletXPlus
    {
        type            wall;
        inGroups        1(wall);
        nFaces          12;
        startFace       8259;
    }
    inletYMinus
    {
        type            wall;
        inGroups        1(wall);
        nFaces          12;
        startFace       8271;
    }
    inletYPlus
    {
        type            wall;
        inGroups        1(wall);
        nFaces          12;
        startFace       8283;
    }
    outlet
    {
        type            wall;
        inGroups        1(wall);
        nFaces          25;
        startFace       8295;
    }
    valve
    {
        type            wall;
        inGroups        1(wall);
        nFaces          70;
        startFace       8320;
    }
    walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1545;
        startFace       8390;
    }
)

// ************************************************************************* //
