tutorials/multiCompression/quadPiston/case/0/Orig/U.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0]; // [kg m s K kg-mol cd]

internalField   uniform (0 0 0);

boundaryField
{
    // Injection
	injectionXMinus
    {
		type            uniformFixedValue;
		uniformValue    constant (-100 0 0);
    }
	injectionXPlus
    {
        type            uniformFixedValue;
        uniformValue    constant (100 0 0);
    }
	injectionYMinus
    {
        type            uniformFixedValue;
        uniformValue    constant (0 -100 0);
    }
	injectionYPlus
    {
        type            uniformFixedValue;
        uniformValue    constant (0 100 0);
    }

	// Inlet
	inletXMinus
    {
        type            uniformFixedValue;
        uniformValue    constant (-100 0 0);
    }
	inletXPlus
    {
        type            uniformFixedValue;
        uniformValue    constant (100 0 0);
    }
	inletYMinus
    {
        type            uniformFixedValue;
        uniformValue    constant (0 -100 0);
    }
	inletYPlus
    {
        type            uniformFixedValue;
        uniformValue    constant (0 100 0);
    }

	// Other
    outlet
    {
        type            zeroGradient;
    } // outlet
    valve
    {
        type            noSlip;
    } // valve
    walls
    {
        type            noSlip;
    } // walls
}

// ************************************************************************* //
