tutorials/multiCompression/quadPiston/case/0/Orig/T.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0]; // K

internalField   uniform 290;

boundaryField
{
    // Injection
	injectionXMinus
    {
        type            fixedValue;
        value           uniform 600;
    }
	injectionXPlus
    {
        type            fixedValue;
        value           uniform 600;
    }
	injectionYMinus
    {
        type            fixedValue;
        value           uniform 600;
    }
	injectionYPlus
    {
        type            fixedValue;
        value           uniform 600;
    }

	// Inlet
	inletXMinus
    {
        type            fixedValue;
        value           uniform 290;
    }
	inletXPlus
    {
        type            fixedValue;
        value           uniform 290;
    }
	inletYMinus
    {
        type            fixedValue;
        value           uniform 290;
    }
	inletYPlus
    {
        type            fixedValue;
        value           uniform 290;
    }

	// Other
    outlet
    {
        type            zeroGradient;
    } // outlet
    valve
    {
        type            zeroGradient;
    } // valve
    walls
    {
        type            zeroGradient;
    } // walls
}

// ************************************************************************* //
