tutorials/multiCompression/quadPiston/case/0/Orig/T.txt
TIME	T
0   	381
1 		374
2 		375
3 		395
4 		428
5 		478
6 		558
7 		685
8		875
9		1574
1   	1818