tutorials/multiCompression/quadPiston/case/0/T.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0]; // K

internalField   uniform 858.1;

injection	 	400;

inlet	 		293.15;

// inlet (/*(time value)*/
// 	(0 	 381)
// 	(0.1 374.4)
// 	(0.2 375.9)
// 	(0.3 395.6)
// 	(0.4 428.2)
// 	(0.5 478.8)
// 	(0.6 558.8)
// 	(0.7 685.1)
// 	(0.8 875.9)
// 	(0.9 1574.8)
// 	(1 	 1818.1)
// );

boundaryField
{
    // Injection
	injectionXMinus
    {
        type            uniformFixedValue;
        uniformValue    uniform $injection;
    }
	injectionXPlus
    {
        type            uniformFixedValue;
        uniformValue 	uniform $injection;
    }
	injectionYMinus
    {
        type            uniformFixedValue;
        uniformValue 	uniform $injection;
    }
	injectionYPlus
    {
        type            uniformFixedValue;
        uniformValue 	uniform $injection;
    }

	// Inlet
	inletXMinus
    {
        type            uniformFixedValue;
		uniformValue 	uniform $inlet;

    }
	inletXPlus
    {
        type            uniformFixedValue;
        uniformValue 	uniform $inlet;
    }
	inletYMinus
    {
        type            uniformFixedValue;
        uniformValue 	uniform $inlet;
    }
	inletYPlus
    {
        type            uniformFixedValue;
        uniformValue 	uniform $inlet;
    }

	// Other
    outlet
    {
        type            zeroGradient;
    } // outlet
    valve
    {
        type            zeroGradient;
    } // valve
    walls
    {
        type            zeroGradient;
    } // walls
}

// ************************************************************************* //