tutorials/multiCompression/quadPiston/case/0/alpha_gas.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alpha_gas;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

injection	 	1;

boundaryField
{
    // Injection
	injectionXMinus
    {
        type            fixedValue;
        value           uniform $injection;
    }
	injectionXPlus
    {
        type            fixedValue;
        value           uniform $injection;
    }
	injectionYMinus
    {
        type            fixedValue;
        value           uniform $injection;
    }
	injectionYPlus
    {
        type            fixedValue;
        value           uniform $injection;
    }

	// Inlet
	inletXMinus
    {
        type            zeroGradient;
    }
	inletXPlus
    {
        type            zeroGradient;
    }
	inletYMinus
    {
        type            zeroGradient;
    }
	inletYPlus
    {
        type            zeroGradient;
    }

	// Other
    outlet
    {
        type            zeroGradient;
    } // outlet
    valve
    {
        type            zeroGradient;
    } // valve
    walls
    {
        type            zeroGradient;
    } // walls
}

// ************************************************************************* //
